controllers/PasswordChangeController.php

SELECT * FROM `tbl_employee` WHERE `pk_int_emp_id`='4'
UPDATE `tbl_employee` SET `date_modified`=NOW(), `vchr_password`='704e5f9d2e701943f3fa1654acffa40a86d898f0' WHERE `pk_int_emp_id`=4
---
    public function actionChangepassword($id)

    {
    	 $model = TblEmployee::find()->where(['pk_int_emp_id'=> $id])->one();
      if($model!=null)
        {
    	 $post_data=Yii::$app->request->post();
         // var_dump($post_data['TblEmployee']);
         //  die;



    	 $post_salary_mapping=$post_data['TblEmployee'];

         $old_password=sha1($post_salary_mapping['old_password']);
         $new_password=$post_salary_mapping['new_password'];
         $repeat_password=$post_salary_mapping['repeat_password'];
         if($new_password===$repeat_password)
         {
          $pass=$model->vchr_password;
          if($pass===$old_password)
          {
            $model->vchr_password=sha1($new_password);
            $model->date_modified=new Expression('NOW()');
            if($model->save(false))